window.AppConfig = {
    channelName: "bagercaa",       // ВПИШИ СЮДА СВОЙ НИК ИЛИ НИК ДЛЯ ТЕСТА
    rewardName: "Заказать видео",  // Точное название награды за баллы
    defaultVolume: 30,             // Громкость видео Ютуба по умолчанию (0-100)
    chatMsgLifetime: 15000,        // Сколько висит сообщение в чате (15000 = 15 сек)
    maxChatMessages: 12,           // Максимум сообщений на экране

    // ==========================================
    // НАСТРОЙКИ: Ротатор Социальных сетей
    // ==========================================
    socialRotateTime: 30000,       // Время показа одной соцсети (в миллисекундах, 30000 = 30 сек)
    socialNetworks: [
        {
            id: "telegram",        // Идентификатор (для поиска SVG иконки)
            title: "Telegram",     // Надпись сверху
            handle: "t.me/pizdeckakoi_to", // Твой ник или ссылка
            color: "#24A1DE"       // Голубой
        },
        {
            id: "tiktok",
            title: "TikTok",
            handle: "@_ksusha_sher_",
            color: "#FF0050"       // Розово-красный
        },
        {
            id: "vk",
            title: "ВКонтакте",
            handle: "vk.com/club236843653",
            color: "#0077FF"       // Синий
        }
    ],

    // ==========================================
    // НАСТРОЙКИ: Система Алертов
    // ==========================================
    alertDuration: 5000            // Сколько секунд висит алерт (5000 = 5 сек)
};